[
  {
    "slug": "betsol",
    "companyName": "BETSOL",
    "summary": "Currently working as a Software Engineer working on BETSOL’s new SaaS platform as a Frontend Developer.",
    "description": "As a Software Engineer at BETSOL, a leading data management and intelligent automation company, I had the opportunity to work on the company's new SaaS platform, Sentinel. My journey began with extensive R&D, where I conducted in-depth research on a variety of solutions that could benefit the project. As the project transitioned into the development phase, I took on the role of a frontend developer, leveraging my expertise in building intuitive and user-friendly interfaces.",
    "duration": "JULY 2021 - PRESENT",
    "keyFocus": "ReactJS, Redux, NodeJS, Material UI, Auth0, Agile/SAFe",
    "workExperience": [
      {
        "title": "Software Engineer",
        "duration": "JANUARY 2023 - PRESENT",
        "description": "As a Software Engineer at BETSOL, I am currently working on the company's new SaaS platform, Sentinel, taking ownership of features, liaising with the UI/UX team, and playing a key role in decision-making. In addition, I have mentored junior team members, improving team performance and individual growth. I also played a critical role in PI planning and sprint grooming sessions, dividing feature requirements into user stories and delegating tasks among the team."
      },
      {
        "title": "Associate Software Engineer",
        "duration": "JULY 2021 - JANUARY 2023",
        "description": "Worked as an Associate Software Engineer on BETSOL’s new SaaS platform as a Frontend Developer, developing and building critical features during the initial phases of the project."
      }
    ],
    "projects": [
      {
        "name": "Sentinel",
        "duration": "AUGUST 2022 - PRESENT",
        "description": "Sentinel is BETSOL's new SaaS platform for creating, managing and notifying subscriptions. It will enable a given user to view, backup and restore all of their devices’ data in one spot. <br /><br />Being a part of a brand new project, apart from being a frontend developer, I worked on a lot of R&D as well before the start of development. <br /><br />Some of my contributions to the project include: <br/><br />- Researched, documented, and built POCs for various subscription management and user management services.<br/>- Actively contributed in critical product design and wireframing sessions, shaping the final product.<br/>- Set up the initial codebase for the project including aspects like finalizing the folder structure, Material UI Global theme config, Sonarqube, etc. <br/>- Developed and owned various features' end-to-end implementation, ensuring strict adherence to design and code quality guidelines. <br/>- Effectively handled payment-related features utilizing hosted components from payment gateways, while following the PCI guidelines. <br/>- Implemented role-based access and sectioning and routing logic for the entire frontend application.",
        "link": "https://sentinel.zmanda.com/"
      }
    ],
    "awards": [
      {
        "title": "Best Training Award - React",
        "duration": "NOVEMBER 2022",
        "description": "The best training award was nominated by the campus batch of 2022. Among all the training subjects and topics, training conducted for react was voted the best."
      },
      {
        "title": "Spot Award",
        "duration": "FEBRUARY 2022",
        "description": "Was awarded the Spot Award to recognize efforts put into researching new frameworks and services and building POCs during the R&D phase of Sentinel."
      },
      {
        "title": "Team Excellence - Sentinel",
        "duration": "APRIL 2022",
        "description": "The team excellence award was awarded to the Sentinel team for building the initial version of SaaS platform with multiple features within a short period of time."
      },
      {
        "title": "Team Excellence - Campus recruitment",
        "duration": "JULY 2022",
        "description": "Was part of the campus interview panel team which won the team excellence award for interviewing 10,000 students from 160 colleges pan India. "
      }
    ],
    "otherResponsibilities": [
      {
        "title": "Campus Training",
        "duration": "JULY 2022",
        "description": "I was one of the trainers for the Javascript and ReactJS training for the 2022 campus batch. My responsibilites included finalizing the syllabus, developing slides and content, designing projects and assignments and framing quiz questions. The training sessions went on for 3 days which included 3 code along projects and one final project assignment."
      },
      {
        "title": "Internship Mentoring",
        "duration": "JULY 2022 - PRESENT",
        "description": "I mentored multiple batches of interns on a new in-house product helping HRs onboard employees with ease. My responsibilities include overseeing the progress of the project, assigning tasks, teaching and mentoring when needed, taking technical decisions based on R&D performed and continuously evaluate the interns based on their performance."
      }
    ]
  },
  {
    "slug": "dhiyo-ai",
    "companyName": "Dhiyo",
    "summary": "Interned at Dhiyo.ai, working on various core projects including the complete overhaul of Dhiyo's company website.",
    "description": "I worked as a Software Engineer Intern at Dhiyo.ai, a Multilingual Conversational AI Platform to Employ blue calller workers. I mainly worked on overhauling Dhiyo's company website rebuilding it with latest tools and technologies. I also worked on some of the side projects such as a Jio Phone version of Dhiyo and a job fair platform.",
    "duration": "DECEMBER 2020 - MARCH 2021",
    "keyFocus": "ReactJS, GatsbyJS, NodeJS, Material UI, TailwindCSS",
    "workExperience": [
      {
        "title": "Software Engineer Intern",
        "duration": "DECEMBER 2020 - MARCH 2021",
        "description": "Interned at Dhiyo.ai, working on various core projects including the complete overhaul of Dhiyo's company website."
      }
    ],
    "projects": [
      {
        "name": "Dhiyo Company Website",
        "duration": "DECEMBER 2020 - MARCH 2021",
        "description": "I worked on the development of a brand new website for Dhiyo which needed an overhaul in terms of design and technology. The project involved setting up the codebase with the required plugins and CSS libraries, development of all the required screens with functionality following the design given, implementing serverless functions for captcha and form handling, integrating feedback and deploying the website with domain setup.",
        "link": "https://dhiyo.ai/"
      },
      {
        "name": "Dhiyo Jio Phone App",
        "duration": "MARCH 2021",
        "description": "I worked on the frontend development of a Jio Phone application for Dhiyo which included the essence of the platform with minimal features. The application had to be built keeping in mind the limited screensize and functionalities of a keypad phone. This application was tested on the phone and sent to the Jio Team for publishing."
      },
      {
        "name": "Dhiyo Job Fair Platform",
        "duration": "MARCH 2021",
        "description": "I worked on the frontend development of a Job Fair web platform for Dhiyo where attendees of a job fair could register and apply to jobs with their resumes in a job fair. Factors such as low network connectivity, offline persistence and other aspects of a crowded limited network access place had to be considered while developing this portal."
      }
    ]
  }
]
